Ran Plan for dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
+ create
 <= read (data resources)

Terraform will perform the following actions:

  # data.oci_core_vnic.webhost01Vnics will be read during apply
  # (config refers to values not yet known)
 <= data "oci_core_vnic" "webhost01Vnics"  {
      + availability_domain    = (known after apply)
      + compartment_id         = (known after apply)
      + defined_tags           = (known after apply)
      + display_name           = (known after apply)
      + freeform_tags          = (known after apply)
      + hostname_label         = (known after apply)
      + id                     = (known after apply)
      + is_primary             = (known after apply)
      + mac_address            = (known after apply)
      + nsg_ids                = (known after apply)
      + private_ip_address     = (known after apply)
      + public_ip_address      = (known after apply)
      + skip_source_dest_check = (known after apply)
      + state                  = (known after apply)
      + subnet_id              = (known after apply)
      + time_created           = (known after apply)
      + vlan_id                = (known after apply)
      + vnic_id                = (known after apply)
    }

  # data.oci_core_vnic_attachments.webhost01VnicsAttach will be read during apply
  # (config refers to values not yet known)
 <= data "oci_core_vnic_attachments" "webhost01VnicsAttach"  {
      + availability_domain = (known after apply)
      + compartment_id      = "ocid1.compartment.oc1..aaaaaaaa3pkequhrpjjdqd4i7ldhs6piblz2hiadbk5i3juy3xautlmzypxa"
      + id                  = (known after apply)
      + instance_id         = (known after apply)
      + vnic_attachments    = (known after apply)
    }

  # data.oci_identity_availability_domains.ADs will be read during apply
  # (config refers to values not yet known)
 <= data "oci_identity_availability_domains" "ADs"  {
      + availability_domains = (known after apply)
      + compartment_id       = "ocid1.compartment.oc1..aaaaaaaa3pkequhrpjjdqd4i7ldhs6piblz2hiadbk5i3juy3xautlmzypxa"
      + id                   = (known after apply)
    }

  # oci_core_instance.webhost01 will be created
+ resource "oci_core_instance" "webhost01" {
      + availability_domain                 = (known after apply)
      + boot_volume_id                      = (known after apply)
      + compartment_id                      = "ocid1.compartment.oc1..aaaaaaaa3pkequhrpjjdqd4i7ldhs6piblz2hiadbk5i3juy3xautlmzypxa"
      + dedicated_vm_host_id                = (known after apply)
      + defined_tags                        = (known after apply)
      + display_name                        = "demoHostWeb01"
      + fault_domain                        = (known after apply)
      + freeform_tags                       = (known after apply)
      + hostname_label                      = (known after apply)
      + id                                  = (known after apply)
      + image                               = (known after apply)
      + ipxe_script                         = (known after apply)
      + is_pv_encryption_in_transit_enabled = (known after apply)
      + launch_mode                         = (known after apply)
      + metadata                            = {
          + "ssh_authorized_keys" = "ssh-rsa AAAAB3NzaC1yc2EAAAABJQAAAQEAwsLOjrH+ukEk72AW5hUvyAMf+J6ES8vC3uFglIFK6SkcvsAFHkoYrHJoJmxRGe3Fwo9WmnwgxqMbhA0gEnBFP6IhxwNgWxSkB0M1uTCLNJ4WXlYKoXwh50GelBsRcryzuzDchCXm7kA4U0/KzD4KPMb+KveDmArRugLEK4gS8TDJBGCCSTOrYOhvQb/s7qkrDOT+rQDhYs+C/kmBPbs/XwJsOUiQi4crUamYqPyq71oWGBnXBUEi6qWnywwchOAT1VRRpT+I/hlx8HZt03EZy/Fvl+86sMISoDXN9mgL3D5xZJNCFw8iKzmPUr+HMsoNW8Hlf5B6+hmNH0GPotqHrw== rsa-key-20191127"
          + "user_data"           = "IyEvYmluL2Jhc2ggLXgKeXVtIC15IGluc3RhbGwgaHR0cGQKIyBPcGVuIHBvcnQgODAgb24gdGhlIGZpcmV3YWxsIHRvIGFsbG93IGh0dHAgYW5kIGh0dHBzIHRyYWZmaWMgdGhyb3VnaDoKZmlyZXdhbGwtb2ZmbGluZS1jbWQgLS1hZGQtc2VydmljZT1odHRwCnN5c3RlbWN0bCBlbmFibGUgZmlyZXdhbGxkCnN5c3RlbWN0bCByZXN0YXJ0IGZpcmV3YWxsZAojIFN0YXJ0IHRoZSB3ZWIgc2VydmVyOgpzeXN0ZW1jdGwgc3RhcnQgaHR0cGQKIyBBZGQgYW4gaW5kZXguaHRtIGZpbGUgb24gZWFjaCBpbnN0YW5jZSB0byBpbmRpY2F0ZSB3aGljaCBzZXJ2ZXIgaXQgaXMuCmhvc3RuYW1lID4vdmFyL3d3dy9odG1sL2luZGV4Lmh0bWwK"
        }
      + private_ip                          = (known after apply)
      + public_ip                           = (known after apply)
      + region                              = (known after apply)
      + shape                               = "VM.Standard1.2"
      + state                               = (known after apply)
      + subnet_id                           = (known after apply)
      + system_tags                         = (known after apply)
      + time_created                        = (known after apply)
      + time_maintenance_reboot_due         = (known after apply)

      + agent_config {
          + is_management_disabled = (known after apply)
          + is_monitoring_disabled = (known after apply)
        }

      + create_vnic_details {
          + assign_public_ip       = "true"
          + defined_tags           = (known after apply)
          + display_name           = (known after apply)
          + freeform_tags          = (known after apply)
          + hostname_label         = (known after apply)
          + private_ip             = (known after apply)
          + skip_source_dest_check = (known after apply)
          + subnet_id              = (known after apply)
          + vlan_id                = (known after apply)
        }

      + launch_options {
          + boot_volume_type                    = (known after apply)
          + firmware                            = (known after apply)
          + is_consistent_volume_naming_enabled = (known after apply)
          + is_pv_encryption_in_transit_enabled = (known after apply)
          + network_type                        = (known after apply)
          + remote_data_volume_type             = (known after apply)
        }

      + shape_config {
          + gpu_description               = (known after apply)
          + gpus                          = (known after apply)
          + local_disk_description        = (known after apply)
          + local_disks                   = (known after apply)
          + local_disks_total_size_in_gbs = (known after apply)
          + max_vnic_attachments          = (known after apply)
          + memory_in_gbs                 = (known after apply)
          + networking_bandwidth_in_gbps  = (known after apply)
          + ocpus                         = (known after apply)
          + processor_description         = (known after apply)
        }

      + source_details {
          + boot_volume_size_in_gbs = (known after apply)
          + kms_key_id              = (known after apply)
          + source_id               = "ocid1.image.oc1.iad.aaaaaaaabip6l5i5ikqsnm64xwrw2rrkj3tzo2dv47frowlt3droliwpvfaa"
          + source_type             = "image"
        }

      + timeouts {
          + create = "60m"
        }
    }

  # oci_core_internet_gateway.ig will be created
+ resource "oci_core_internet_gateway" "ig" {
      + compartment_id = "ocid1.compartment.oc1..aaaaaaaa3pkequhrpjjdqd4i7ldhs6piblz2hiadbk5i3juy3xautlmzypxa"
      + defined_tags   = (known after apply)
      + display_name   = "demoIG"
      + enabled        = true
      + freeform_tags  = (known after apply)
      + id             = (known after apply)
      + state          = (known after apply)
      + time_created   = (known after apply)
      + vcn_id         = (known after apply)
    }

  # oci_core_route_table.vcnRoute will be created
+ resource "oci_core_route_table" "vcnRoute" {
      + compartment_id = "ocid1.compartment.oc1..aaaaaaaa3pkequhrpjjdqd4i7ldhs6piblz2hiadbk5i3juy3xautlmzypxa"
      + defined_tags   = (known after apply)
      + display_name   = "demoRouteTable"
      + freeform_tags  = (known after apply)
      + id             = (known after apply)
      + state          = (known after apply)
      + time_created   = (known after apply)
      + vcn_id         = (known after apply)

      + route_rules {
          + cidr_block        = (known after apply)
          + description       = (known after apply)
          + destination       = "0.0.0.0/0"
          + destination_type  = (known after apply)
          + network_entity_id = (known after apply)
        }
    }

  # oci_core_security_list.vcnSec will be created
+ resource "oci_core_security_list" "vcnSec" {
      + compartment_id = "ocid1.compartment.oc1..aaaaaaaa3pkequhrpjjdqd4i7ldhs6piblz2hiadbk5i3juy3xautlmzypxa"
      + defined_tags   = (known after apply)
      + display_name   = "demoPubSecName"
      + freeform_tags  = (known after apply)
      + id             = (known after apply)
      + state          = (known after apply)
      + time_created   = (known after apply)
      + vcn_id         = (known after apply)

      + egress_security_rules {
          + description      = (known after apply)
          + destination      = "0.0.0.0/0"
          + destination_type = (known after apply)
          + protocol         = "6"
          + stateless        = (known after apply)
        }

      + ingress_security_rules {
          + description = (known after apply)
          + protocol    = "6"
          + source      = "0.0.0.0/0"
          + source_type = (known after apply)
          + stateless   = false

          + tcp_options {
              + max = 22
              + min = 22
            }
        }
      + ingress_security_rules {
          + description = (known after apply)
          + protocol    = "6"
          + source      = "0.0.0.0/0"
          + source_type = (known after apply)
          + stateless   = false

          + tcp_options {
              + max = 80
              + min = 80
            }
        }
      + ingress_security_rules {
          + description = (known after apply)
          + protocol    = "6"
          + source      = "10.1.0.0/16"
          + source_type = (known after apply)
          + stateless   = false
        }
    }

  # oci_core_subnet.pubSubnetAD1 will be created
+ resource "oci_core_subnet" "pubSubnetAD1" {
      + availability_domain        = (known after apply)
      + cidr_block                 = "10.1.0.0/24"
      + compartment_id             = "ocid1.compartment.oc1..aaaaaaaa3pkequhrpjjdqd4i7ldhs6piblz2hiadbk5i3juy3xautlmzypxa"
      + defined_tags               = (known after apply)
      + dhcp_options_id            = (known after apply)
      + display_name               = "pub_subnet1"
      + dns_label                  = "pubsub1"
      + freeform_tags              = (known after apply)
      + id                         = (known after apply)
      + ipv6cidr_block             = (known after apply)
      + ipv6public_cidr_block      = (known after apply)
      + ipv6virtual_router_ip      = (known after apply)
      + prohibit_public_ip_on_vnic = (known after apply)
      + route_table_id             = (known after apply)
      + security_list_ids          = (known after apply)
      + state                      = (known after apply)
      + subnet_domain_name         = (known after apply)
      + time_created               = (known after apply)
      + vcn_id                     = (known after apply)
      + virtual_router_ip          = (known after apply)
      + virtual_router_mac         = (known after apply)
    }

  # oci_core_virtual_network.vcn will be created
+ resource "oci_core_virtual_network" "vcn" {
      + cidr_block               = "10.1.0.0/16"
      + compartment_id           = "ocid1.compartment.oc1..aaaaaaaa3pkequhrpjjdqd4i7ldhs6piblz2hiadbk5i3juy3xautlmzypxa"
      + default_dhcp_options_id  = (known after apply)
      + default_route_table_id   = (known after apply)
      + default_security_list_id = (known after apply)
      + defined_tags             = (known after apply)
      + display_name             = "demoVCN"
      + dns_label                = "demovcn"
      + freeform_tags            = (known after apply)
      + id                       = (known after apply)
      + ipv6cidr_block           = (known after apply)
      + ipv6public_cidr_block    = (known after apply)
      + is_ipv6enabled           = (known after apply)
      + state                    = (known after apply)
      + time_created             = (known after apply)
      + vcn_domain_name          = (known after apply)
    }

Plan: 6 to add, 0 to change, 0 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d .`
* :put_litter_in_its_place: To **delete** this plan click [here](https://d026c4bafb11.ngrok.io/lock?id=atlantis-user%252Fmyrepo553%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d .`
</details>

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
